#!/usr/bin/env python
# -*- coding: utf-8 -*-
# author：Wayne


import re
'''
查找手机号码的格式，并且判断手机号码是否是合法的手机号。

查找身份证号码校验格式，并且判断身份证号码是否合法。
'''


'''
手机前三位数：
130, 131, 132, 133, 134, 134, 135, 136, 137, 138, 139, 140, 
141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 
153, 154, 155, 156, 157, 158, 159, 166, 170, 171, 173, 173, 
174, 175, 175, 176, 176, 177, 177, 178, 178, 180, 181, 182, 
183, 184, 185, 186, 187, 188, 189, 198, 199
'''

def getPhonePattern():
    return re.compile(r'(((13|14|15|18)\d)|(166|198|199)|(17[013456789]))\d{8}')


print(getPhonePattern().match("18927106340"))
print(getPhonePattern().match("12327106340"))


def getIdCardPattern():
    return re.compile(r'^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$')


print(getIdCardPattern().match("445122199412290018"))
print(getIdCardPattern().match("445122199412290018da"))
