#!/usr/bin/env python
#-*- coding:utf-8 -*-
# author:Wayne.Chen


'''
位运算：
进行位运算的时候，需要把数值转为二进制的来进行计算
'''

'''
& 按位与
3&2 = 2
011
010
---
010
'''
print(3&2)

'''
按位或|
3|2=3
011
010
---
011
'''
print(3|2)

'''
按位异或^
3^2=1
011
010
---
001
'''
print(3^2)

'''
按位取反~
~3 = -4
0000 0011
---------
1111 1100 [补码]
==> 反码 ==> 原码
'''
print(~3)

'''
左移运算<<，低位不够则补0
3<<2=12 <==> 3*2^2
   011
   ---
   011 00
'''
print(3<<2)

'''
右移运算<<，溢出则舍去
3>>2=0 <==> 3//2^2
011
---
000 11
'''
print(3>>2)
